app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title
---
 def index
    @all_ratings = Movie.uniq.pluck(:rating)
    if params[:sort] == "title"
     @css = "hilite"
     @movies = Movie.find(:all, :order => 'title')
    elsif params[:sort] == "release date"
     @movies = Movie.find(:all, :order => 'release_date')
     @css = "hilite"
    else
     @movies = Movie.all